from typing import Dict, Any

CategoryMapping = Dict[str, Dict[str, Any]]


CATEGORY_MAPPING: CategoryMapping = {
    "breakfast": {"id": 1, "name": "Завтраки"},
    "salad": {"id": 2, "name": "Салаты"},
    "soup": {"id": 3, "name": "Супы"},
    "hot_meal": {"id": 4, "name": "Горячие блюда"},
    "bake": {"id": 5, "name": "Выпечка"},
    "dessert": {"id": 6, "name": "Десерты"},
    "drink": {"id": 7, "name": "Напитки"}
}

DIFFICULTY_MAPPING = {
    "one_star": 1,
    "two_stars": 2,
    "three_stars": 3,
    "four_stars": 4,
    "five_stars": 5
}

WELCOME_TEXT = """👋 Привет! Я бот для работы с рецептами.

🍽️ Здесь вы можете:
• Просматривать все рецепты
• Просматривать личные рецепты
• Добавлять новые рецепты
• Редактировать и удалять рецепты*

Выберите действие в меню ниже:"""